{"podcast_details": {"podcast_title": "Lights On Data Show", "episode_title": "How to Improve Data Transparency", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_nologo/15163458/15163458-1620881413547-ccdc444b874db.jpg", "episode_transcript": " Hello everybody. Welcome on the Lights on Data show. My name is George. You're a host for today. So today we are going to tackle the topic of how to improve data transparency and we're going to do so with our lovely guest, Lauren Maffeo. Welcome Lauren. Hi George. Thank you so much for having me. I'm excited to be here. Pleasure is all mine. Now you are the senior service designer at Steampunk, but also the author of Designing Data Governance from the Ground Up. What an incredible feature to write a book. Congratulations for that. Thank you. I know it's a hard process. I was mentioning to you before the show, I've been trying to kickstart a book of my own, but it's hard to even start something like that up. You're an award-winning analyst, designer, frequent speaker at conferences and events, and you do have an impressive background and experience and really looking forward to tackle this topic with you today. Thank you so much. I'm really excited to be here. Speaking of you being a frequent speaker at conferences and events, from what you've just told me before, where are you going to go next? Yeah, later today at about 5.45 Eastern, I am actually flying to North Macedonia through Vienna. I'm going to be in Austria first to connect for a flight to Skopje in North Macedonia. I'm going to be co-leading a training session for teachers in North Macedonia on the broad subject of disinformation, what it is, how to recognize it, how to combat it, and most importantly, how to teach the concept of misinformation to students in North Macedonia. This is something that we of course struggle with around the world. It's becoming even more of a problem this year with the big rise of generative AI. Tools like ChatGPT and other deep fake content has made it much more difficult to discern whether a piece of content was created by a human or a bot. I think the more we can learn about what this content is, how it's created, how to recognize the signs of human-generated content versus machine-generated content. I think it's like any other skill that you can teach. The hard part is that it's always evolving, much like the data and data best practices. These are rapidly growing fields where best practices are constantly evolving almost faster than you can teach them. I think that's the biggest challenge, but I am really passionate about the subject and I am looking forward to exploring a new part of the world. I've been to Dubrovnik, Croatia before, but other than that, this will be my first trip to the Balkan region. I'm really looking forward to it. Oh, very nice. I was going to say that not only you're very skilled in the topic, but you sound very passionate about it as well. I am. I think it's very important. I was a media studies major in college and even back then, I saw issues in my opinion with media literacy as the internet was continuing to grow and evolve. That was over a decade ago now, and so you can only imagine how much things have changed since then. I actually see a lot of parallels between challenges with media literacy and with data literacy because the volume of data that is produced and ingested has grown exponentially, not just in the last decade, but especially in the last couple of years. That number in volume of data is only going to increase. I see a lot of parallels between how we as practitioners and educators can discuss these topics which might not seem on the surface to have a lot related to each other directly, but I think they actually do have a lot of overlap. That might seem like a really good topic for your second book then. Yes, perhaps. Yes. But in your current book, in your first book, Design Data Governance from the Ground Up, you do emphasize that importance of data transparency. So why don't we go first on what does data transparency mean in the context of data governance and its impact on organizations? That's a great question. I think it's always important in these discussions to define what you're talking about up front. I find that in industry discussions, we often make assumptions about the knowledge that we or the people we're speaking with have, and we assume that we're on the same page talking about the same things, and especially when it comes to data governance, part of the reason I wanted to write this book is because I think there are a lot of misnomers about what data governance is. And so in the context of what data governance is, when we're talking about it and when I discussed it in the book, I think of data governance as the confluence of people, processes, and tools that you deploy to manage your organization's data at scale. So it's ultimately your strategy for how you are managing your company data in the most effective way. And a huge part of that, I would say the backbone of your data governance should be data transparency. And what I mean by that is ultimately it answers the question of why are we doing this? Because I think a lot of people do wonder what the value of governance is, why you should invest in it, because it is an investment, even though I will make the case all day long that it is valuable to do and essential to do, that does not mean that it is easy or a short process. And so it is a valuable exercise. And ultimately what you're trying to do is increase transparency. You're trying to give your consumers more faith in the, not just the data that you produce, but also the data that you might have about them. You want to increase transparency about how you handle it so that they can have a better sense of what you are doing with that data, whether you're using it to make money or to use targeted advertising on them. And they might be fine with that, but as long as you show what you're doing with the data you collect, that is important. So it increases trust that you have with your customers. It also really helps colleagues work more cohesively together, because if you had a data architecture environment that is more easy to use and more accessible across the organization, you are able to increase transparency internally. So if you think about it from front end development, which is what the user sees on a website versus the backend development, which is how that website runs, we can look at transparency with data the same way. Data transparency is about your interactions with your users and consumers and assuring them of what you are doing with the data that you collect on them. But it also goes back to how you manage that data on a day-to-day basis and the decisions that you make about how to design your architecture, how to assign data stewards, all of that. And I do maintain that transparency is the ultimate reason why you would want to invest in any type of data governance. Thank you so much, Lauren. So just to try and sum it up, everything that you said, because it's a lot of content, all useful of course, but from what I gather is one is providing those customers with that inside look on how their data is being collected and has been used. And at the same time, to make sure that data that has been used, it's used with integrity, it's used fairly, lawfully, ethically, and for valid purposes. Correct. I think that's a great definition. Right. Now, what are some of the common challenges and common barriers that you've noticed that organizations are facing when they're trying to improve that data transparency? Yep. One common barrier I often hear is this concept of organizational size and structure. And I sometimes have people in small organizations and startups who approach me after I give talks and they will say, I work for a 10 person company and I'm effectively doing two roles. I don't know if I have the staff to do data governance. I don't have enough people to serve as data stewards. I don't think we have more than maybe two or three data domains. And in a way, I would actually say that type of person has an advantage over a very large multinational organization, which has existed for decades and has thus been collecting data for decades. And when you're in that scenario, you might in theory have the team and resources to invest in data governance. You probably have a bigger budget along with a bigger staff, but the concept of not only establishing data governance and data transparency practices from scratch, but then retroactively applying them to all of the data that you currently exist, that's a very overwhelming task. And I think that's a huge challenge with data governance today is the technical debt is astronomical and it certainly feels astronomical. It can feel like you are almost too far gone to really make any progress on data governance. So I see that as a barrier. I also think that there is still way too much talking past each other when it comes to the data side of organizations versus the business side. I think that when it comes to discussions about data governance, sometimes we as an industry don't speak about it in a way that is very tangible or applicable outside of our context. So data practitioners, whether you're an analyst, a scientist, an architect, we're all used to talking about fields and file types and building pipelines and all of those things. But if you can't discuss how those actions ultimately impact the business and what you're working on and what problem you're solving, you're really not going to make much progress. And I actually see this fairly often with data scientists where they have this incredibly specialized deep domain expertise in particular areas of data science. They often have PhDs, so they're incredibly intelligent. But when they're working in business environments, they often feel like they're purely an executor and they're not really a strategic partner, even though they have more information at their disposal to help the business when it comes to data. And so I think that's also a huge challenge in making data and data governance real and viable and tangible and really showing the benefits of it. I spoke at a online event hosted by Dataversity last month where someone suggested using the term data enablement instead of data governance because words do matter and framing data governance as a positive, as something that is going to benefit your business and at least trying to socialize that language and see how it goes, that can actually make a lot of progress. And it's something I'm considering myself, especially to overcome some of those barriers to data governance that we've talked about. Oh, definitely. Definitely. A lot of things to unpack there. Again, a lot of great things that he mentioned. I agree with that. I even mentioned that in my online course on practical data governance with him. We can look at other names and data enablement as one of them, if that's what sort of helps code it a little bit better. And if it helps sell it a little bit better and get that change management practices that way and adoption in place, why not? But anyhow, telling that data story, and another guest of ours, Scott Taylor, the Data Whisperer has a lot of great things to talk about that on how do you tell that data story? How do you sell it back to the business? How do you make it? What's important, what's in it for me? You always need to tie it to that individual, that unit, that entire organization, tie it to their goals, their pain points, and sell it that way. And like you said, there's so much there to unpack and at times it really seems overwhelming and then it was reiterating where you're measuring bigger problems, bigger data and tech debt. But sometimes you just have to start and it's great to just split it down into little chunks and tackle it a little bit at a time. Otherwise, it goes to be overwhelming and you're not going to do anything. And that's exactly why I wrote the book. It's a short book and that's by design. It's a 100 page six step guide to help the reader build their first data governance program from scratch, assuming that you do not have anything other than the cloud infrastructure and architecture. It assumes that you have data, but it assumes that you are really starting from the beginning and I kept the book short and simple because there was a lot of nuance to data governance. A multinational corporation like we talked about is going to implement it very differently than a 50 person startup. It's going to depend on the tech stack they have, the budget they have, which data dictionary they're using. There's a lot of nuance and I still maintain that to lay the foundation for successful data governance in whatever environment you have, you still need to do these really six fundamental things that move data transparency forward. And that really starts with knowing why you're doing it and communicating the benefits of transparency for your customers, but also for your colleagues. Because I think something else that we need to do, going back to the data literacy point, there's a lot of talk about creating data driven organizations and it's almost just a throwaway phrase at this point because it's one of those things that CEOs throw around and it means both everything and nothing at the same time. And I think when we talk about being data driven and building data driven orgs, the most important thing you can do is to include everyone in your data efforts. That does not mean that everybody is building pipelines, that everybody is going into, it was on web services and building out your architecture, but it does mean that you make this concept of data governance real and tangible for everyone regardless of their role. And you talked earlier, George, about benefits of data governance and how it's really our job to communicate what those benefits are, not just for the business, but for you and your role. But I think that's especially crucial when it comes to data stewards and finding people who can serve as data stewards in your organization. If they are in marketing or sales or customer success, it's on us to explain not just why they should help out and abide by data governance, it has to go so much deeper than that by showing how their participation in this effort is going to help them improve their work because everyone's work is touched by data today. And if we can't start by successfully communicating that, I think you're going to have a very difficult uphill battle. Oh, definitely. And you mentioned on how it's tied to data literacy, how they go hand in hand. Do you have any strategies that organizations can use to promote data literacy among employees and stakeholders to then enhance that data transparency? I see a lot of opportunities for data professionals to mimic what people in the cybersecurity space are doing. So we know that the number one cause of an organizational cyber breach is an internal employee. That does not mean they did it on purpose. It means that there was a hack of some sort very often and then valuable business data is exposed to a bad actor. And so this has been happening more and more in recent years, especially during COVID. More of us are remote, more of us are using different devices, more of us are putting company data on our own devices and that is an enormous risk for the business. So organizations can no longer ignore cybersecurity. And I will say they did for many years. Cybersecurity was an afterthought. I remember very vividly when the open source community writ large did not want to discuss the fact that security was a massive slog in many open source projects. And now we talk about making this stuff real. Sounds like the Colonial Pipeline hack recently showed how essential it is, how disruptive it is to daily life when data is not secure. And so in response to that, you've seen a lot of CIOs and CISOs doing these internal campaigns with their companies where they run phishing attempts. They will run attempts to see who clicks on malicious links. And if you do, then they will show you what you should look out for in future links to ensure that you do not click on a real phishing attempt later on. So they will educate their employees on how to recognize phishing attempts, both via email, but also via your phone because hackers are getting much smarter about targeting personal devices and by impersonating both. I have had people text me and call me impersonating not just my colleagues, but my clients before in order to get information out of me. So it's really crucial that companies know that and know how to educate their employees on how to spot the signs of those phishing attempts. And likewise, I think with data, there's a real opportunity for chief data officers to do these mini micro learning opportunities by sending little quizzes out via email telling people how to recognize a piece of data that meets quality standards for your org versus one that does not. By rewarding people who participate in data governance efforts, I think that's crucial by teaching them how to format data correctly if it needs to be in a certain format or it needs to be uploaded to a particular place because very often there is some random spreadsheet that lives on someone's local machine and it was never actually uploaded to a singular place where everyone could access it. And this is all a bit vague, but it's really to the point that the opportunities are there. They are somewhat limitless. You can really, as the CDO, get as creative as you want about educating your team on strong data practices and data transparency. But I do think it's worth looking at what CISOs and CIOs are doing to educate their teams on cybersecurity because there's a lot of overlap between data governance and transparency and cybersecurity because what are you keeping secure if not your data? Love it. So data security is a significant concern for organizations, of course, also individuals, but so is data privacy. So how can organizations strike that balance between data transparency and protecting that sensitive information? It's admittedly a challenge. If anyone here is familiar with GDPR, that is European legislation, which dictates what organizations can and cannot use private data for. It also gives any EU citizen the right to query any organization around the world that has their data to ask how it's being used. And if they don't get a satisfactory answer, they can actually file a lawsuit. The chances of that happening in the broad scheme of things are relatively low, and GDPR is in the modern data legislation space a somewhat extreme example. I will say it does put a burden on organizations to a degree and it affects US organizations. So I went to a graduate school in London and once GDPR came out, they stopped sharing, having databases and hosting databases overseas for exactly that reason. They wanted to be in compliance with GDPR. And I think depending on the stance you take, if you're going to take a really hard stance when it comes to legislation, it can impede your business practices. It can be disruptive. I think ultimately from the consumer side, it really comes down to consent and also writing out how you are using particular data and keeping it secure in language that is both accurate and as easy for someone to understand as possible. So that does not mean sending somebody a digital form that is 100 pages long. And of course, you're never going to read all of that. You're just going to click on it so you can get to the end. And it turns out you've signed away all of your rights to your data to give it over to this company. I think there are other opportunities for organizations to be more transparent about what they use data for. If you're a for-profit organization, I don't think people have this expectation that you will never use the data you collect for commercial purposes. I do, though, think it's very important to be transparent about not only how you're collecting the consumer's data, what you are using it for, whether you use it in other opportunities to make the business money, but also you want to frame it in terms of how you manage that data on a daily basis. And so that goes back to looking at your whole architecture and seeing how that is set up. Do you have data lineage set up? Do you have opportunities to see how one piece of data is used in various algorithmic contexts? Do you know who data steward is for a particular data domain? Meaning if you have a question about data in that domain, do you know the right person to go to ask for clarification? When we talk about transparency, I think of it in the modern data context as having everyone be in the same environment. That does not mean that you are using one tool to solve all of your data problems because I think that's a fallacy, but it does go back to the many projects I've been on where there are five databases, some are on-prem, some are in the cloud. The client doesn't know which data is where. They don't know. None of these systems integrate with each other. And so then, especially if you're in a consulting role, your job becomes doing discovery and that discovery can often take months because the client does not have that transparency into which data lives where. And that sounds like a very basic concept, but it's a problem that I have noticed in my career over and over. And I do think when we talk about data transparency, it's often in the consumer context. I think we need to use it in the professional context as well to give more colleagues more visibility into where all data is within your systems. Thank you, Lauren. So you mentioned tools. Are there any specific tools or solutions that you're aware of that can assist organizations in achieving their greater data transparency goals? In the context of data governance and architecture, I often talk about data mesh. And data mesh is this concept of managing your data, not as a top-down service that IT owns and then every request for particular types of data has to go through them. Instead, under data mesh, you're managing data as domain-specific products in the same environment. And so what you would do is you would establish one environment. You would have your data domains defined. So these are the key areas that your organization collects data on, whether they're related to marketing, sales, customer success, product data. Those can be four different data domains with respective subdomains defined underneath by the stewards. You would have within your data mesh architecture, these four to five different data domains, each with their own data lake and data dictionary. And so you are organizing the data according to domains within the architecture, but they're all in the same environment. So even though you have these data lakes that are set up to be domain-specific, they are all ultimately in, let's say, AWS. And then what they do is they all hook up to the same catalog, which is for the data mesh itself. So that singular catalog is where there's ingestment of data from all of the domains. That mesh catalog is what you're consuming apps have come to. And so the idea, if you send it up correctly, is to have this real-time flow of data that is all in the same environment. It is ultimately all going to the same catalog so that the latest data can be hooked up and consumed by these apps that are integrated with the system. But it also keeps your data organized within the data mesh. And it also gives people a much more clear idea of who those data domain owners are. So let's say, for instance, that you are the VP of Sales and you really need to know some analytics on the Q3 marketing campaign. Under this model, you would be able to go into the data mesh environment, make a request for that particular type of marketing data from the marketing data steward. They would be able to make an informed decision about whether to give you that data and how, as opposed to that traditional model of going to IT. Data mesh is still very young and evolving in the data architecture space. And it does require a lot of resources, especially in terms of both people and budgets. So it can be out of scope for a lot of people. But I really think there's a lot of value in this data as products mindset because it is a very fundamental shift. And it's similar to the mindset shift I was trying to achieve with this book, which is that first of all, data governance is not a technical problem to be solved. It really is a cultural challenge in this broader digital transformation conversation we hear so much about. And the emphasis is that it's really something you can design into your organization. And so when we think about data governance and transparency, you can design your data architecture to be more transparent. And again, that's a fundamental shift from thinking of transparency as a byproduct of your architecture and your data decisions. You can actually have more autonomy from the start to design a more transparent data architecture. And that may be a little bit intimidating depending on where you are in your data journey and your architecture now, but it's also really empowering because it gives you a lot more choice than you might have thought you previously had. Definitely. And with this type of architecture and tools as well that you're employing that you've described, not only then you're able to provide the end user, the consumer of that data with the data sets that they need, but you can also keep track of what's being requested, what's the purpose, who's using what. It's all great and it does enhance that data transparency. And Dan Everett had a follow-up question on that data mesh as it's really a big topic right now as he's mentioning. Do you have any other best practices for federated governance that you can share with the audience? That's a great question. And I love, Dan, that you did ask about federated governance because when I talk about design, designing, governance for data mesh, I do include a section on federated governance. I think federated governance comes down to a few key things, namely documentation, cybersecurity practices that are also documented, and then also ownership. And I think ownership of data is really where I see a lot of organizations struggle the most. This whole concept of finding and assigning data stewards, of getting people to make decisions about data, of getting people to agree on quality standards for what data looks like, these are very difficult questions. You will realistically not get to singular answers for these questions by the time you set up your environment, but those are the aspects of federated governance that I think should be highly prioritized because there's a lack of documentation in the tech world writ large, definitely with code, much more so with data. And I think the other challenge I see with data often that needs to be addressed with federated governance is context. I read a really great blog post recently about how so much data has no context, and so its help is really limited. And so I think we need to focus on bringing more data into a contextual space where you have more information about the numbers in front of you. And again, this is not an easy task, but when you create that more transparent environment, you can get to those questions and answers much more naturally than going on this goose chase to try to find them. So looking into the future, what trends or developments do you foresee in the realm of data transparency and data governance? I do hope that data lineage tracking will become much more commonplace. At a high level, data lineage allows you visibility into how different pieces of data are used throughout your organization in various different contexts. So I think lineage tracking will become a much more mainstream option for data teams, especially as legislation in the US ramps up and it becomes more of an expectation that people will have that visibility into data, which they don't have already. I am curious and optimistic, I hope, about the data as product mindset shift in this sphere. I, as mentioned, think that there's a lot of value to it. It is fundamentally a mindset shift that is a large one, but I'm hearing a lot about it. And so more than any particular type of architecture, I hope that concept continues to gain steam because I think it holds a lot of value. And I would really like to see more integration between the business side of organizations and the tech side, especially as it pertains to data governance. This is a really challenging topic to speak about across teams and to make real for people. And I look forward to seeing ways that organizations will do that and really innovate in that space because I think there's a big question mark around it. And I would really like to see that answered by more organizations in the next couple of years. Thank you so much, Lauren. Now, I do recommend people to follow you on LinkedIn and of course, buy your book, Designing Data Governance from the Ground Up, Six Steps to Build a Data-Driven Culture. And I believe you can find that book on your local Amazon. You can, yes. It is available on Amazon. It is also available at barnesandnoble.com. It's available on Target's website. Many local bookstores have it. You can also go to pragprog.com. So that's P-R-A-G, P-R-O-G dot com. And again, the book is called Designing Data Governance from the Ground Up. If you want to buy it through pragprog.com, you can use the code DATAGOV23ALLCAPS for 35% off your ebook copy, which is available on all e-readers, Kindles, and tablets. And so if this conversation resonated with you and you want to learn more about the basics of building a data governance program, I would really love for readers and listeners to find the book and let me know what you think. Thank you so much, Lauren. And thank you so much, everybody, for tuning in today and for all your lovely comments and questions. Looking forward to next week. Lauren, have a great trip and yeah, knock them out. Thanks, George. Thanks for having me. Pleasure is all mine. Bye, everybody."}, "podcast_summary": "In this podcast episode, host George discusses data transparency and data governance with guest Lauren Maffeo, a senior service designer. They explore the definition of data transparency and its importance in data governance, as well as the challenges and barriers organizations face in achieving data transparency. They discuss strategies for promoting data literacy among employees and stakeholders, and they highlight the balance between data transparency and data privacy. They also mention the concept of data mesh and federated governance as potential solutions. Finally, they discuss future trends in the realm of data transparency and data governance. Overall, the episode provides valuable insights into the topic of data transparency and its significance in organizations.", "podcast_guest": "The guest in the podcast is Lauren Maffeo.", "podcast_highlights": "Highlights of the podcast include:\n\n- The importance of data transparency in data governance and its impact on organizations.\n- The challenges organizations face in improving data transparency, such as organizational size and structure, and the communication gap between data practitioners and the business side.\n- Strategies to promote data literacy and enhance data transparency, such as using mini micro-learning opportunities, quizzes, and rewarding participation in data governance efforts.\n- Balancing data transparency with data privacy by obtaining informed consent, providing clear information on data usage, and maintaining data security.\n- The benefits and best practices of using data mesh and federated governance, including documentation, cybersecurity practices, and data ownership.\n- Potential trends and developments in data transparency and data governance, including the increased use of data lineage tracking, the shift towards a data-as-product mindset, and improved integration between the business side and tech side of organizations.\n\nListeners are encouraged to follow Lauren Maffeo on LinkedIn and to check out her book, \"Designing Data Governance from the Ground Up.\" The book is available on platforms such as Amazon and Barnes & Noble, and a discount code for an ebook copy is provided."}