{"podcast_details": {"podcast_title": "The David Rubenstein Show", "episode_title": "Jane Fraser", "episode_image": "https://www.omnycontent.com/d/playlist/e73c998e-6e60-432f-8610-ae210140c5b1/4d56c12f-2316-44f8-bc9a-ae3c0003206b/b3927dcf-9c18-47af-9b1c-ae3c00032087/image.jpg?t=1660854946&size=Large", "episode_transcript": " No one just watches a movie anymore. They play the video game, stream the soundtrack, and binge the companion podcast. Boundaries between Hollywood and Silicon Valley have blurred, and everyone is scrambling for one thing. Screen time. Join me, Lucas Shaw, for Bloomberg Screen Time, our new LA event that will connect entertainment's brightest minds with guests like Ted Sarandos of Netflix, insecure creator Issa Rae, and podcast king Bill Simmons. Catch it on October 11th and 12th and find out more at BloombergLive.com slash Screen Time. A major trailblazer in the financial service system is Jane Fraser. Two years ago, she became the CEO of Citi, and in doing so, became the first woman to head a major money center bank. Today, Citi and other major banks in the United States are facing challenges to the banking system. I sat down with Jane Fraser recently to talk about these and other challenges. Anything new in the banking world? It's been a quiet week. Quiet week, David. So let's talk about what has been going on. Let's start with the easy ones. Silicon Valley Bank. What went wrong there? Well, before we dive into that, I've worked in financial markets all around the world, and I have to say we're very lucky in America. This is the best financial system in the world. It is the end of the world. Okay. But despite it being the best, we have some problems from time to time. Yeah, but they're isolated problems. So when you look at it, the financial systems is broad. It's deep here. It's competitive. We've got some large banks that are well-capitalized and a source of strength at the moment. We have medium-sized banks, regional banks, and by and large, they are equally well-capitalized, serving their communities, playing an important part in the banking system. This is quite isolated. Okay. But people are still interested in hearing about it. So your bank is well-capitalized. Your bank, I should have said, is a bank with about 230,000 employees and about an $85 billion market capitalization. So your bank is in good shape, and your bank is the fourth biggest bank in the United States, right? JP Morgan, Bank of America, Wells Fargo, and then Citi. There is a bank on the West Coast called Silicon Valley Bank, or there was a bank there, not as well-capitalized. I mean, did the regulators not understand what was going on, or the people in the banking world, people like you, were you surprised by what happened? You had a combination of two pieces. You've had the macro and some idiosyncratic factors around Silicon Valley Bank, but then you also had the impact accelerated by social media of what went down. And the rates curve and the increase in rates has been most we've seen, the fastest and the steepest in 40 years. So there's a bit of pain that comes from that. Secondly, you did have idiosyncratic factors, I think is the polite British way of describing them in Silicon Valley Bank. So as all this played out, you saw some pretty serious holes in their balance sheet management, and they had a very concentrated client base. And that client base ended up burning cash much faster than anticipated. And they ended up wanting to raise capital, and it went down pretty quick. In the Great Recession in 07, 08 or so, the U.S. government passed TARP legislation, and under the TARP legislation, large amounts of capital were injected into banks, including Citi. And effectively, that meant that the shareholders, the creditors, and the depositors were all protected. This time around, Silicon Valley Bank was only the depositors were protected over a decision made by the Biden administration, others over the weekend. Do you think that was the right decision to protect only the depositors and say goodbye to the shareholders and goodbye to the creditors? I think it's very important to protect the depositors. Right now, the banking system everywhere around the world depends on confidence, and that confidence has to be in the safety and security of deposits. So in terms of the most important job here, they did the most important job, which is making sure the depositors were whole. So in the old days, when there were bank runs, you used to see people lined up outside the street and get their money out. Now, you're just going to your iPhone or whatever phone you have, you can take your money out. So money moves so quickly. Was that a factor as well in having the money get out of a bank so quickly on the wait in line? You can just do it over there. It is a complete game changer from what we've seen before, David. You're absolutely right. There were a couple of tweets, and then this thing went down much faster than has happened in history. And frankly, I think the regulators did a good job in responding very quickly, because normally you have longer to respond to this. So they acted with quite a lot of speed, given how quickly this happened. So some people say you have a moral hazard when you protect people. So by protecting all the depositors in Silicon Valley Bank, the implication was that if somebody else has a problem, we'll protect them and so forth. And so the $250,000 limit is meaningless, more or less. Or do you think the Federal Reserve and the Secretary of Treasury are saying we're not going to protect every depositor or we're going to protect certain depositors? I don't think they need to go out right now, because the banking system is pretty sound. And we're talking about a few banks. We had it from the chairman pal today. This is not something that is spread across the entire banking system. This isn't like it was last time. This is not a credit crisis. This is a situation where it's a few banks that have some problems, and it's better to make sure that we nip that in the bud. Not the pick on the West Coast, but there's another West Coast bank, First Republic Bank, which is around the country, but based in San Francisco. And they've had some problems. They've had gigantic decline in their market value and so forth. Do you expect that somebody will bail them out or buy them? Well, I'm not going to comment in depth on First Republic, because they are actively working through the challenges that they're facing right now. What you saw last week was a number of the large banks, 11 of us, got together to put a large capital deposit injection into them to help buy the time to make sure that they could come up with the right solution for the restructuring that's needed. So the large banks and others put in roughly $30 billion of deposits. I think you put in roughly $5 billion or something like that. So how did that happen? Did Jamie Dimon call you up and say, hey, you have $5 billion you don't really need, and you can put it in First Republican? Is it that you have to go to your board to say, I need to get $5 billion somewhere? I mean, how do you make that decision? And was it you just say to Jamie, I'll call you back, I'll think about it? How does that work? So one of the great things about this was actually that the banks did all come back together. Because you think of it, we're all pretty, we usually try and kill each other in different deals that we're trying to do. So there's a lot of competition between us. But in this instance, this is one where we're in a strong position. We want to stop what could have been a problem. And we all know when there is a confidence crisis, the logic that takes over, isn't it necessarily rational? So we wanted to go and help protect the system. It's in the interest to do so. So despite this being quite a divisive environment that we're all operating in, this is an instance of the banks coming together and saying, OK, what can we do? What can we do here to support a system that we have confidence in? And you don't put $5 billion into the system through the generosity of your own heart. You do it because you have confidence in the system itself. You expect to get that money back eventually? Yes. OK, so Jamie Dimon is a great banker. I think he's been the head of JP Morgan for 17 years, something like that. Who? Jamie Dimon. Well regarded. But why do you think it is the case that he's calling around and doing this and not the secretary of treasury, the chairman of the Federal Reserve, the head of the FDIC? Why is it a non-government person is doing this? I would have thought a government person would do this. David, why do you think that Janet wasn't calling around doing it? Do you believe everything you read in the newspapers on these ones? Because when people in Washington do something good, they usually have the press know about it. But maybe she was calling around. I'm sure she was. But Jamie seems to be getting all the credit, if credit is the right word, or is that not fair to give him the credit? Oh, Jamie played a role. I think we all played a role and so did. It was a very active discussion over that weekend. Would Citi consider buying First Republic or you're not interested? No. No, you're not buying. OK. Another bank called Credit Suisse. Credit Suisse seemed to dissolve very, very quickly. Were you surprised at how quickly that bank kind of went away after about 100 years of being around? So the nice thing is we're talking about three or four banks out of the thousands that are here in the states and the rest of it. So let's put that in perspective. So Credit Suisse, I don't think anyone was falling off their chair that Credit Suisse ultimately ended up where it did. It was really a question of time. It's been a troubled institution for a long time. Those of you who don't know it, it's a very global bank. It's got a very strong operation in Switzerland, good wealth management in Asia, an investment bank here in the states and around the world. But it's had a lot of issues. It's had a lot of management instability. It's had a number of different crises and things that have hit it. Well, Credit Suisse has some great private bankers and they have some great clients. Are the city bankers calling up the Credit Suisse former employees and saying you should come here now or something like that? No, I think they're calling us. They are. OK. All right. OK. No one just watches a movie anymore. They play the video game, screen the soundtrack and binge a podcast too. Boundaries have blurred and everyone is scrambling for one thing, screen time. Join me, Lucas Shaw, for Bloomberg Screen Time, our new L.A. event that will connect entertainment's brightest minds. We'll be interviewing guests like Ted Sarandos of Netflix, Donna Langley of NBC Universal and Ari Emanuel, the super agent at Endeavor. Catch it on October 11th and 12th. You can find out more at BloombergLive.com slash Screen Time. Growing up, what did you say you wanted to be the CEO of Citi when you were growing up? What did you think you wanted to be? Oh, I wanted to be a doctor when I grew up, but I was really lousy at biology. So that kind of new that one. That happens a lot to people who want to go to medical school. So, OK, you grew up in Edinburgh area. Yep, I did. And were your parents bankers? No, definitely not. So my father was a Scottish accountant, which meant you you're not really relying on parental generosity and extra pocket money from a Scottish accountant as a father. So I used to earn my pocket money on the golf course at St. Andrews County. You would not know it from my golf game, but I'm sure it's better than mine. So you went to Cambridge after you graduated. What did you do after I graduated? After I graduated, I joined Goldman as an analyst. And that's an easy job to get and an easy job when you have it. You don't work more than 30, 40 hours a week. Yes, yes. So how many years did you do that? So I worked at Goldman for a couple of years and I was young when I started and everyone was, I was the boring girl from Scotland. Everyone else was European, spoke multiple languages and was a lot more exotic and interesting than me. So after I finished the honors program, I thought I'd better make myself a bit more interesting. So I moved to Spain. Did you speak Spanish before? I didn't. So now you speak Spanish. Si hablo español perfectamente. Que tal su español? Well, I know one word maybe C or something like that. I don't know. I thought it was cerveza. So I, you know, my language skills are very limited. So, so. Luckily you have other talents though, which is a fortunate thing. Spanish isn't one of them. So you do that for a couple of years and then you decide to go where? To America. All right. And where do you want to go in America? So I did the same again, taught my way into Harvard Business School and I was fascinated by the American machine. And if you've spent a bit of time in Europe and grown up in the, you know, the 80s, 70s and 80s, it's fascinating. America is just something you want to try and understand in the American economy and the American entrepreneurs, not someone you ever want to bet against. So when you went to Harvard Business School, you entered in 92, something like that. Yes, that's right. You entered in 92. Were there a lot of women in your class? Probably about 24, 25 percent, something like that. Yes. And there were enough of us to cause trouble. All right. You graduate from Harvard Business School and then you decide to go to McKinsey. Yes, I did. And why did you want to be a consultant? Well, first of all was why didn't why didn't I go back into banking at that time? And I've been in banking in the 80s where there weren't many women in banking, unlike the business school. They wore suits with very big shoulder pads and they were more scary than the men. You remember that you remember the era. And so when I looked at the consulting, particularly McKinsey, I like partnerships. I think partnerships are great places to grow up. The apprenticeship model is wonderful. Global institution and firm. And also it was quite strategic in what they were looking at. It was similar issues to M&A at Corbin. But I thought I would have a chance of having a family, a bit more predictability in the work schedule. So you did it for 10 years, roughly 10 years. And you had two children during that time. So you you go to McKinsey, you work your way up, you become a partner there. And, you know, being a partner, McKinsey is a great job. Why did you decide to leave to go to city? I became a mom at the same time as I became a partner. And I was I worked part time all the way through my partnership. Yes. And McKinsey was fantastic about that because I was able to spend time with the kids before they went into school. But then when they got when they were then at school, that I felt like, OK, I can go back full time working again. And I, you know, I honestly I felt like it was time that I could prove that I would I could do it rather than just advice. All right. She went to city at the time. Did you think a woman could become or would ever become the head of city? I honestly never thought about it. It at that point, it's a firm that there were quite a few women around in. I've been in an environment with always very supportive around it. Some fantastic male mentors and others. And it wasn't it was just never something I thought about. This was 20 years ago. So I was a sitting, enjoying the day job. So you had a series of jobs, everyone you were the CEO of this division or that division and so forth. And one time they asked you to move to Latin America to be the CEO of Latin America. Did you think that was a dead end? You're going to move to Latin America, get out of the way of the succession? Or did you think that was a way to get promoted? It was a big turnaround role. And it's one of those ones you say if I did a good job, then that was going to put me in good position for bigger, bigger opportunities. And if I did a bad job, then, you know, so be it. You wouldn't you weren't afraid they would forget you. You're down in Brazil or something and you weren't afraid they would forget you and everything like that. No. OK. So you did a good job. You come back and you're the head of the Global Consumer Bank. What is that global consumer bank in city? So that's that's retail banking. That's a credit card, which I believe you are a proud owner of a city credit card. David, I am. I have that here. I can't I'm getting I don't have enough frequent flyer miles on it, though. I'm trying to you told me I'm not qualified for my frequent flyer miles. But yeah, you've got the wrong card. Is it a is it a is this the best credit card you can get? I think the so David, you have the one with our wonderful partner, American Airlines, and they they. How come you have one? But yours is black. How come mine's gold? How come I don't have it? Which is better? You've got to ask for it, David. Oh, OK. All right. Well, I although I suspect you may not be flying quite as much on the commercial airlines. Are you rich? That's a good question. Is it about what you have in the bank or your 401k? Should you buy a place where you live or hold off? And if you build, could sand shortages in Singapore impact prices in Connecticut? At Bloomberg, we see wealth as more than just money. Our coverage looks at wealth from every angle so you can make smarter decisions. Bloomberg Wealth. All you need to know about wealth. Who has it, who's making it and how you should think about yours. Learn more at Bloomberg dot com slash wealth. Currently, many CEOs are under pressure to take positions on public policy matters. So positions on voting rights or or climate change. So where do you think CEOs should be getting in the middle of talking about those kind of things? Or do you try to not do that when they matter to your business model and when they're important for progress? If you're a bank, you care a lot about economic growth and progress around the world. So yes, we will speak out on that. Also, if it's very important to our people, the communities that we're in, it will be topics we'll talk about. We don't view this as being political, but it's about what do we stand for as a bank. Now, what about diversity, equity and inclusion? What are you doing to make certain you have other diversity standards met in the bank? It's a really important part of the bank is I think because we've got people from everywhere who work at Citi and they want to work for an American enterprise. It's a real compelling point of the bank in attracting talent from all over the world. For Citi, my predecessor really was very focused on making sure that we had strong diversity of all types in the bank. And we worked out that radical transparency is very, very valuable. So we put out three year targets on representation and we disclose those every year. We disclose exactly what they are. The targets we have on both recruiting and in retention and in promoting are in everybody's scorecard. And we also have pay equity. So every single year we measure, you have a third party come in and make sure that every woman is paid exactly the same as a man in the same job performing at the same level. When did you realize for the first time I could be or you could be the CEO of the bank? I mean, you know, there are a lot of people you have two hundred thirty thousand employees. A lot of them want to be CEO. When did you realize for the first time you had a chance to get that? When I was made president of the bank, because up until then you just you don't really have a sense. But that was a point when Mike and John had a conversation about being a likely successor, but no guarantees in life and I better do a good job. OK, so your predecessor was Michael Corbett. He retired about two years ago. You succeeded him. What was the biggest challenge you had in becoming the CEO right away? It was covid. So this was becoming CEO during covid is not the easiest because you know, you're once used to going around, going to different sites, seeing our people, seeing our clients in person. And while soon did an amazing job, it is not the same. And so I know you have to learn how to lead in a different way. Today, Citi is a bank that is announced. It's changing its strategy. You now want to be a consumer and an institutional bank in the United States. Is that right? And you're getting out of the consumer business outside of the United States. So what we've said we are rather than what we're not is that we know it's a pretty extraordinary bank in its history and in its presence globally. It's uniquely operate, opens the doors, a bank in a hundred different countries. So the city is to be the preeminent banking partner for companies and for investors and for individuals across border needs. And that's the vision of the bank. That's the we will serve that client base as their absolutely critical partner. So you've sold a number of your international consumer businesses and you've announced you're trying to sell your business in Mexico. The consumer business. The consumer business. Who are you going to sell that to? We've been we've been fortunate to have a lot of interest there. We looked at we looked at consumer banking and we could see that originally the view had been that you would get a lot of global scale in consumer banking. And we were very strong in a number of different geographies. But the reality is you don't get as much scale globally. It's much more about local scale in those businesses. So we decided let's focus. We want the bank to be simple. We want to be truly excellent at what we do. And that's better if you're a more focused bank around fuel business lines. So that's all right. That's the path we're on. So the bank stock under your predecessors and to some extent are new hasn't really moved in 10 years. Is that a concern. Well we are transforming the bank to make sure that we're in a very different position. So they were changing the strategy of the bank as we talked about. And that entails selling sixty five thousand employees. It's twenty five percent of our employee base. So we can really focus and double down on the businesses that make sense. And two hundred thirty thousand you have you're selling sixty five thousand. Yes. Oh wow. Yes it's a lot. And I think it's under the belief that what where we where we truly excel we will move every single day four trillion dollars of volume for five thousand multinational firms. And then there's no other bank in the world that can do that. That's an incredible asset for America. It's a strategic asset for the states because you'd much rather have American companies operating on American banking rails and not foreign banking rails particularly these days. So that's what we're focusing the bank around is that client base. And it's a big transformation David right. This is bold. This takes some courage to do. We're making really good progress on it. And we're putting a lot of investment into modernizing the bank because we've had some regulatory orders against us as well to make sure that we make the investments we need to. And making sure the culture is there of real excellence but also to be a human bank. We've talked about that being important. All put all that together. That's a lot of transformations a lot of work. But we've really we're determined around it and we're completely convinced that puts the bank into a different profitability different return profile and ultimately the benefit of our shareholders. Suppose I'm listening to what you say and I say she's obviously articulate she's committed. Maybe I'll buy our stock. You think your stocks a good buy right now. Yes. Very I buy it. I can get an appreciation of some percent I can be happy with you think not as good as private equity returns but good right. For young professionals. Yes. Why should they want to work in a large commercial bank. What's the appeal of it. Why. If somebody gets goes to Harvard Business School why not go to a private equity firm a hedge firm. One of these you know important organizations and why. What's the. Well how do you recruit people into a place like city. What is it that you say is so great about being a commercial banker. America's global banks are right in the center of some of the biggest challenges that are going on in the world geopolitically. We get pulled into the conversations we're supporting. We're playing a critical role in supporting clients and countries. And you get an opportunity to come and work and learn in a team environment in an apprenticeship model on how to tackle and solve some of these pieces. What do you do for relaxation to get away from the office from time to time. You are a golfer or something. Yeah. But I love spending time with my kids. So you know being able to try to spend some time with them. They're less enthusiastic now than they used to be when they're little about that. But I'll take what I get. They tell you they tell their friends who you are or they don't want to. Oh so when I was announced as CEO I knew it was going to happen. I called up my son and I said didn't pick up as usual. I said please call me and I get it. I didn't pick up. No no didn't pick up. He sent a message about I'm on. I'm busy. I said no please. I've got some news. Could you could you pick up. And he's like mom I mean I'm on zoom calls. I mean I'm really busy. And and he did not pick up did not pick up. I ended up having to text him the next morning but it was going to be announced. And then he came back to me at the end of the day and said mom you know it was a text message. It wasn't a call. I said mom you know you're all over the news today. Are you important or something. Dot dot dot dot. Thanks for listening. To hear more of my interviews you can subscribe and download my podcast on Spotify Apple or wherever you listen. Are you rich. That's a good question. Is it about what you have in the bank or your 401k. Should you buy a place where you live or hold off. And if you build could stand shortages in Singapore impact prices in Connecticut. At Bloomberg we see wealth as more than just money. Our coverage looks at wealth from every angle so you can make smarter decisions. Bloomberg wealth all you need to know about wealth who has it who's making it and how you should think about yours. Learn more at Bloomberg dot com slash wealth."}, "podcast_summary": "In this podcast, Bloomberg interviews Jane Fraser, the CEO of Citigroup, about the challenges and changes in the banking industry. Fraser discusses the recent problems faced by banks like Silicon Valley Bank and Credit Suisse, emphasizing the importance of protecting depositors and maintaining confidence in the banking system. She also shares her thoughts on the role of CEOs in public policy matters and the importance of diversity and inclusion in the banking industry. Fraser talks about Citigroup's strategy to focus on being a consumer and institutional bank in the United States and its plans to sell its consumer businesses outside of the country. She highlights the bank's transformation efforts, including workforce reductions and investments in modernization, aiming to provide excellent service to its clients and deliver better profitability for shareholders. Fraser concludes by addressing the appeal of working in a large commercial bank and her commitment to spending time with her children as a form of relaxation.", "podcast_guest": "The podcast guest mentioned in the provided text is Jane Fraser. Her job title is the CEO of Citi, a major money center bank.", "podcast_highlights": "Highlights from the podcast episode:\n\n- Jane Fraser became the CEO of Citibank two years ago, making her the first woman to head a major money center bank.\n- The banking system in the United States is currently facing challenges, but Fraser emphasized that overall, the system is the best in the world.\n- Silicon Valley Bank faced troubles due to macro and idiosyncratic factors, leading to holes in their balance sheet management and a concentrated client base.\n- The decision to protect only depositors and not shareholders and creditors was deemed necessary to maintain confidence in the banking system.\n- Fraser discussed the challenges faced by Credit Suisse and First Republic Bank, highlighting the need for collaboration among banks to support a sound banking system.\n- Fraser shared her perspective on CEOs taking positions on public policy matters, stating that it is important for banks to speak out on topics related to economic growth and the interests of their people and communities.\n- Diversity, equity, and inclusion are essential aspects of Citibank's focus, with transparency in representation targets and pay equity measures in place.\n- Citibank is undergoing a transformation in its strategy, aiming to be a leading banking partner for companies, investors, and individuals with cross-border needs.\n- The bank is selling off its consumer businesses outside of the United States to create a more focused and excellent bank.\n- The stock performance of Citibank has been stagnant in recent years, but Fraser believes that the ongoing transformation and strategic focus will lead to a different profitability and return profile.\n- Fraser highlighted the appeal of working in a large commercial bank like Citibank, citing the opportunity to be at the center of global challenges and play roles in supporting clients and countries.\n- Fraser finds relaxation in spending time with her children and being involved in their lives, despite their less enthusiastic response to her CEO role."}
